// Задача 19: Напишите программу, которая принимает на вход пятизначное число 
// и проверяет, является ли оно палиндромом.

// 14212 -> нет
// 23432 -> да
// 12821 -> да

void palindrom(int p)
{
    Console.Write(p + " -> ");
    if (p / 10000 == p % 10 && (p / 1000) % 10 == (p % 100) / 10) Console.WriteLine("да");
    else Console.WriteLine("нет");

    //Console.WriteLine(
    //p / 10000 + " == " + p % 10 + " && " + (p / 1000)%10 + " == " + (p % 100) / 10
    //);
}

palindrom(14212);
palindrom(23432);
palindrom(12821);